---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NodePropertyNotSet
source: html/de28ea85-85f1-97a1-dbf9-8d6da345036e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NodePropertyNotSet Property

The calculation could not be executed as configured. Specify a constraint property set for the following input or output node(s).

## Syntax (C#)
```csharp
public static FailureDefinitionId Network_NodePropertyNotSet { get; }
```